package com.testing_system.tester.gateway.controllers;

/*
Задачи контроллера:

    - Создание теста (метаданные + правила прохождения + первая версия)
    - Удаление теста (каскадирование)
    - Создание новой версии теста
    - Удаление новой версии теста
    - Изменение правил прохождения

Создание теста доступно преподавателю
Удаление теста доступно автору теста или админу
Создание новой версии теста доступно автору и соавторам (админ автоматически добавляется в соавторы)
Изменение правил прохождения теста доступно автору и админу
 */
public class TestCreationController {
}
