package com.testing_system.tester.gateway.controllers;

/*
Задачи контроллера:

    - Проведение тестирований
    - Расчет оценки
    - Сохранение истории прохождений
    - Доступ к истории прохождений теста
    - Удаление истории прохождений
    - Доступ к правилам оценивания
    - Доступ к истории прохождений для конкретного студента

Чтение данных доступно студентам
Доступ к общей истории прохождений теста доступен только преподавателям
Расчёт оценки и сохранение попытки производится автоматически после прохождения теста
Очистка истории доступна только админу
 */
public class TestingController {
}
