package com.testing_system.tester.gateway.controllers;

/*
Задачи контроллера:

    - Отображение главной страницы для преподавателя (тесты его авторства/соавторства)
    - Просмотр пройденных и непройденных тестов студента
    - Просмотр всех тестов в базе
    - Поиск и фильтрация
    - Добавление/удаление соавтора

Просмотр пройденных и непройденных тестов реализован для студента (добавить фильтрацию по предмету)
Просмотр всех тестов доступен преподавателю
Добавить/удалить соавтора может только автор теста
Админ и ответсвенный преподаватель добавляются автоматически
 */
public class TestController {
}
